#include<stdio.h>
//数据的存储
/* int main()
{
    int a = 10;
    float f = 10.0;
    short a1 = 10;
    short int b = 10;
    return 0;
}

//空类型
void test(void)
{
    printf("hehe\n");
}

int main()
{
    test();
    return 0;
} */

//整形在内存中的存储
//整形一律使用补码进行存储
/* int main()
{
    int a = 20;
    //00000000 00000000 00000000 00010100 - 原码
    //00000000 00000000 00000000 00010100 - 反码
    //00000000 00000000 00000000 00010100 - 补码
    //正数的原码、反码、补码都一样
    //0x00000014
    int b = -10;
    //10000000 00000000 00000000 00001010 - 原码
    //11111111 11111111 11111111 11110101 - 反码
    //11111111 11111111 11111111 11110110 - 补码
    //0xfffffff6
    return 0;
} */
//原码：直接将数按照正负数的形式翻译成二进制
//反码：将原码的符号位不变，其他位取反
//补码：将反码+1
//为什么要使用补码？
/* int main()
{
    1 - 1;
    1 + (-1);
    //1的原码：00000000 00000000 00000000 00000001
    //1的反码：00000000 00000000 00000000 00000001
    //1的补码：00000000 00000000 00000000 00000001
    //-1的原码：10000000 00000000 00000000 00000001
    //-1的反码：11111111 11111111 11111111 11111110
    //-1的补码：11111111 11111111 11111111 11111111
    //补码相加：00000000 00000000 00000000 00000000 - 33位，溢出，舍弃
    return 0;
} */

//设计一个程序判断当前机器的字节序
/* int check_sys()
{
    int a = 1;
    //返回1，表示小端
    //返回0，表示大端
    return *(char*)&a;
}
int main()
{
    /* int a = 1;
    char* p = (char*)&a;
    if(*p == 1)
    {
        printf("小端\n");
    }
    else
    {
        printf("大端\n");
    } 
    int ret = check_sys();
    if(ret == 1)
    {
        printf("小端\n");
    }
    else
    {
        printf("大端\n");
    }
    return 0;
} */

//练习
int main()
{
    char a = -1;
    //10000000 00000000 00000000 00000001 - 原码
    //11111111 11111111 11111111 11111110 - 反码
    //11111111 11111111 11111111 11111111 - 补码
    //11111111
    //整形提升有符号时补符号位，无符号时补0
    signed char b = -1; 
    //11111111
    unsigned char c = -1;
    //00000000 00000000 00000000 11111111
    printf("a = %d, b = %d, c = %d\n", a, b, c);
    return 0;
}

int main()
{
    char a = -128;
    //10000000000000000000000010000000 - 原码
    //11111111111111111111111101111111 - 反码
    //11111111111111111111111110000000 - 补码
    //10000000
    //整形提升
    //11111111111111111111111110000000
    //结果为4294967168
    printf("%u\n", a);
    return 0;
}
int main()
{
    char a = 128;
    printf("%u\n", a);
    return 0;
}
//结果为4294967168

int main()
{
    unsigned int i;
    for (i = 9; i >= 0; i--)
    {
        printf("%u\n", i);
    }

    return 0;
}
//死循环

int main()
{
    char a[1000];
    int i;
    for (i = 0; i < 1000; i++)
    {
        a[i] = -1 - i;
    }
    printf("%d\n", strlen(a));
    return 0;
}
//255

int main()
{
    unsigned char i = 0;
    for (i = 0; i <= 255; i++)
    {
        printf("hello world\n");
    }
    return 0;
}
//死循环